tap "homebrew/core"
tap "homebrew/bundle"

tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"

tap "wez/wezterm"

# nvim
brew "neovim", args: ["HEAD"]
brew "universal-ctags"

# shell
brew "zsh"
brew "tmux"
brew "reattach-to-user-namespace"
## git
brew "git"
brew "lazygit"
brew "git-delta"
## utils
brew "grep"
brew "ripgrep"
brew "fd"
brew "bat"
brew "tree"
brew "ranger"
brew "broot"
brew "bottom"
brew "jq"
brew "curl"
brew "wget"
brew "zoxide"
brew "tealdeer"
brew "tre"
brew "exa"
brew "tokei"
brew "procs"
brew "zenith"
brew "sd"
brew "dust"
brew "hyperfine"

# terminal
cask "wez/wezterm/wezterm-nightly"

# apps
cask "alfred"
cask "raycast"
cask "penc"
cask "visual-studio-code"
cask "bitwarden"
cask "brave-browser"
cask "discord"
cask "whatsapp"
cask "slack"
cask "spotify"
cask "hiddenbar"
cask "monitorcontrol"

# fonts
cask "font-jetbrains-mono-nerd-font"
