# nvim
brew "tree-sitter", args: ["HEAD"]
brew "neovim", args: ["HEAD"]
brew "universal-ctags"
brew "tree-sitter-cli"

# shell
brew "zsh"
brew "tmux"
brew "reattach-to-user-namespace"
## git
brew "git"
brew "gh"
brew "lazygit"
brew "git-delta"
## utils
brew "grep"
brew "ripgrep"
brew "fd"
brew "bat"
brew "ranger"
brew "broot"
brew "jq"
brew "curl"
brew "wget"
brew "zoxide"
brew "tealdeer"
brew "lsd"
brew "tokei"
brew "procs"
brew "bottom"
brew "zenith"
brew "sd"
brew "dust"
brew "mise"
brew "luarocks"
brew "terminal-notifier"
brew "glow"
## ai
brew "claude-code"
brew "gemini-cli"
brew "opencode"

# terminal
cask "kitty"
cask "wezterm"

# apps
## productivity
cask "penc"
cask "alfred"
cask "raycast"
cask "the-unarchiver"
cask "vlc"
## password
cask "bitwarden"
## notes
cask "microsoft-onenote"
cask "obsidian"
## code
cask "visual-studio-code"
## browsers
cask "arc"
cask "brave-browser"
cask "firefox"
## social
cask "discord"
cask "whatsapp"
cask "slack"
cask "microsoft-teams"
## music
cask "spotify"
## clipboard
cask "maccy"
## ai
cask "claude"
cask "chatgpt"

# fonts
cask "font-jetbrains-mono-nerd-font"
