# nvim
brew "tree-sitter", args: ["HEAD"]
brew "neovim", args: ["HEAD"]
brew "universal-ctags"
brew "tree-sitter-cli"

# shell
brew "zsh"
brew "tmux"
brew "reattach-to-user-namespace"
## git
brew "git"
brew "lazygit"
brew "git-delta"
## utils
brew "grep"
brew "ripgrep"
brew "fd"
brew "bat"
brew "ranger"
brew "broot"
brew "jq"
brew "curl"
brew "wget"
brew "zoxide"
brew "tealdeer"
brew "lsd"
brew "tokei"
brew "procs"
brew "bottom"
brew "zenith"
brew "sd"
brew "dust"
brew "mise"
brew "luarocks"

# terminal
cask "wezterm"

# apps
cask "alfred"
cask "raycast"
cask "penc"
cask "visual-studio-code"
cask "bitwarden"
cask "brave-browser"
cask "zen"
cask "discord"
cask "whatsapp"
cask "slack"
cask "spotify"
cask "hiddenbar"
cask "monitorcontrol"

# fonts
cask "font-jetbrains-mono-nerd-font"
