{
  "alfredsnippet" : {
    "snippet" : "Help me prepare for a job interview for a software engineering role.\n\nI want you to investigate and search online for information about this company.\nIt is important for this summary to always be catered to a software engineering profile.\nDo not make stuff up if you cannot find this information. Be clear that you could not find it and do your best to fill in the gaps.\n\nHere is the summary format I want you to ouput:\n\n# Problem\n\nWhat is the problem the company is trying to solve.\nWrite a simple explanation and summary of the domain the company is working on.\nAfterwards explain the problem in simple terms.\nDo not make stuff up if you cannot find this information. Be clear that you could not find it and do your best to fill in the gaps.\n\n# Solution\n\nHow did the company solved the problem?\nDo not make stuff up if you cannot find this information. Be clear that you could not find it and do your best to fill in the gaps.\n\n# Competitors\n\nGo online and find out the biggest 3 competitors for this company and what they do differently.\nGive a very short and consie summary of how these 3 competitors solved the problem and what differentiates them.\nDo not make stuff up if you cannot find this information. Be clear that you could not find it and do your best to fill in the gaps.\n\n# Mission\n\nThe mission statement of what the company does.\nIt should come from the online research you did.\nDo not make stuff up if you cannot find this information. Be clear that you could not find it and do your best to fill in the gaps.\n\n# Values and Culture\n\nGo online and search for the company, if they exist.\nWrite a short description and explanation of what each value is starting by the name of the value you found online.\nDo not make stuff up if you cannot find this information. Be clear that you could not find it and do your best to fill in the gaps.\n\n# Engineering Culture\n\nFind information about the software engineering culture, if they exist.\nDo they move fast, slow, do they prefer more speed over quality, or quality over speed, etc.\nDo not make stuff up if you cannot find this information. Be clear that you could not find it and do your best to fill in the gaps.\n\n# Architecture\n\nFind engineering blogs and figure out if you can find the architecture that the company is using. Do as many diagrams as needed to paint a clear picture.\nIf, and only if, you cannot find a proper architecture online should you do your best to approximate it using industry standard system design practices.\nDo not make stuff up if you cannot find this information. Be clear that you could not find it and do your best to fill in the gaps.\n\n# Challenges\n\nGo online and see if you can find what are the latest challenges that the company is facing and what are their current pain points and growth points. If there are none currently, try to find out what they had to go through to grow at a particular scale (if applicable).\nDo not make stuff up if you cannot find this information. Be clear that you could not find it and do your best to fill in the gaps.\n\n# Engineer Profile\n\nGo online and see if you can find what type of engineers they are looking for. What type of background, profile, values, expertise they are looking for in an engineer.\nWhat whould be the perfect profile match for this company given their current challenges?\nDo not make stuff up if you cannot find this information. Be clear that you could not find it and do your best to fill in the gaps.\n\n# Questions\n\nGive me 5 smart, consise, to the point, open ended questions that I could ask in an interview, these questions should be catered depending on the type of company. For example, questions for a Seed or Series A startup will be different from big tech companies. Use your best judgement here.\n\n# Conclusion\n\nWrap up this summary with a conclusion of all that you have learned from the company, the mission, the values, the engineering culture\n\n# References\n\nRelevant urls\/links you found in your research including the careers page, engineering blog and articles you used to back up your research in writing this summary.\n\nThank you.\nThe company that I want you to summarize is  ",
    "uid" : "16F04C9A-BF7C-4515-A4A9-DDA97EB228C1",
    "name" : "Company Research",
    "keyword" : "search"
  }
}